# Створіть ієрархію класів із використанням множинного успадкування. Виведіть на екран порядок
# вирішення методів для кожного класу. Поясніть, чому лінеаризація даних класів виглядає саме так.
class SomeClass:
    pass

class OtherClass:
    pass

class AnotherClass(SomeClass, OtherClass):
    pass

print('SomeClass: ', SomeClass.__mro__)
print('OtherClass: ', OtherClass.__mro__)
print('OtherClass: ', AnotherClass.__mro__)

# Чому саме так
# Python використовує C3-лініаризацію, тобто будує порядок так, щоб:
# - спочатку йшов сам клас;
# - потім його батьки зліва направо;
# - далі їхні предки без дублювання;
#- при цьому зберігався коректний порядок наслідування.

# множинне успадкування дозволяє об’єднувати поведінку кількох базових класів;
# MRO визначає, який метод буде викликано першим;
# у Python порядок будується зліва направо, але з урахуванням усіх предків без конфліктів.
