from employee import Employee

emp1 = Employee("Іваненко", "Олександр", "Петрович", "Програміст", 45000, "12.03.2001")
emp2 = Employee("Петренко", "Марія", "Іванівна", "Тестувальник", 38000, "25.07.1998")
emp3 = Employee("Сидоренко", "Андрій", "Миколайович", "Аналітик", 52000, "01.11.1992")
emp4 = Employee("Коваленко", "Олена", "Вікторівна", "Менеджер", 47000, "14.05.2000")
emp5 = Employee("Бондар", "Ігор", "Сергійович", "Дизайнер", 40000, "30.09.1996")
emp6 = Employee("Шевченко", "Тетяна", "Олексіївна", "HR", 43000, "08.02.1999")

list_emps = [emp1, emp2, emp3, emp4, emp5, emp6]